In [1]:
#Reading and writing text file

In [4]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [9]:
#creating CSV file
data = [['q', 'r', 's','t', 'apple'],[2,3,4,5,'pear'],['A','s','d','f','rabbit'],[5,2,5,7,'dog']]

In [10]:
df = pd.DataFrame(data)

In [11]:
df.to_csv('my_data.csv', index=False, header=False)
df

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  A  s  d  f  rabbit
3  5  2  5  7     dog

In [14]:
#importing same csv file
dframe = pd.read_csv('my_data.csv')

In [15]:
dframe

   q  r  s  t   apple
0  2  3  4  5    pear
1  A  s  d  f  rabbit
2  5  2  5  7     dog

In [16]:
dframe = pd.read_csv('my_data.csv',header =None)

In [17]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  A  s  d  f  rabbit
3  5  2  5  7     dog

In [18]:
dframe = pd.read_table('my_data.csv', sep=',',header =None) #importing using read_table

In [19]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  A  s  d  f  rabbit
3  5  2  5  7     dog

In [20]:
pd.read_csv ('my_data.csv',header =None,nrows=2)

   0  1  2  3      4
0  q  r  s  t  apple
1  2  3  4  5   pear

In [23]:
dframe

   0  1  2  3       4
0  q  r  s  t   apple
1  2  3  4  5    pear
2  A  s  d  f  rabbit
3  5  2  5  7     dog

In [25]:
dframe.to_csv('mytextdata_out.csv') #saving csv file

In [26]:
import sys

In [27]:
dframe.to_csv(sys.stdout)

,0,1,2,3,4
0,q,r,s,t,apple
1,2,3,4,5,pear
2,A,s,d,f,rabbit
3,5,2,5,7,dog

In [28]:
dframe.to_csv(sys.stdout,sep='_') #saving file with different seperator

_0_1_2_3_4
0_q_r_s_t_apple
1_2_3_4_5_pear
2_A_s_d_f_rabbit
3_5_2_5_7_dog

In [29]:
dframe.to_csv(sys.stdout,sep='?')

?0?1?2?3?4
0?q?r?s?t?apple
1?2?3?4?5?pear
2?A?s?d?f?rabbit
3?5?2?5?7?dog

In [32]:
dframe.to_csv(sys.stdout,columns=[0,1,2]) #reading specific columns from csv file

,0,1,2
0,q,r,s
1,2,3,4
2,A,s,d
3,5,2,5